; -----------------------------------------------------------------------------
;	乱数発生器
; -----------------------------------------------------------------------------

; -----------------------------------------------------------------------------
;	乱数の初期化
;	input:
;		HL	...	乱数初期化用のタネ
;	output
;		なし
;	break
;		なし
;	comment
;		なし
; -----------------------------------------------------------------------------
randomize::
		ld		[rand_seed], hl
		ret

; -----------------------------------------------------------------------------
;	乱数取得
;	input:
;		なし
;	output
;		HL	...	乱数値 [0～65535]
;	break
;		a, b, h, l
;	comment
;		なし
; -----------------------------------------------------------------------------
random::
		ld		hl, [rand_seed]
		ld		b, h
		ld		a, l
		; HL = HL >> 1
		srl		h
		rr		l
		; L = L xor [[not a] and 0x29]
		cpl
		and		a, 0x29
		xor		a, l
		ld		l, a
		; H = [H xor [[not b] and 0x15]] or [[[not b] << 7] & 0x80]
		ld		a, b
		cpl
		ld		b, a
		and		a, 15
		xor		a, h
		ld		h, a
		ld		a, b
		rrca				; bit0 を bit7 へ移すために右1bit回転を使う
		and		a, 0x80
		or		a, h
		ld		h, a
		ld		[rand_seed], hl
		ret

rand_seed:
		dw		0
