@echo off
rem ***************************************************************************
rem 	SCA program compile batch program
rem ---------------------------------------------------------------------------
rem 	(C)2009 t.hara
rem 	(C)2019 t.hara  Modified for ZMA
rem ***************************************************************************

rem ---------------------------------------------------------------------------
rem 	アセンブラディレクトリをパスに加える
rem ---------------------------------------------------------------------------
set path_back=%PATH%
set PATH=..\..\..\

rem ---------------------------------------------------------------------------
rem 	前回のコンパイルの残骸が残っていれば混じらないように削除する
rem ---------------------------------------------------------------------------
if exist zma.log (
	del /Q *.map > nul
)
if exist *.bin (
	del /Q *.bin > nul
)

rem ---------------------------------------------------------------------------
rem 	BGMデータをコンパイルする
rem ---------------------------------------------------------------------------
cd bgm
call mk_bgm.bat
cd ..

rem ---------------------------------------------------------------------------
rem 	プログラムソースをアセンブルする
rem ---------------------------------------------------------------------------
cd src
copy sca_config_release.asm sca_config.asm

echo [ASSEMBLE] sca.bin
zma sca_link.asm sca.bin
move zma.log sca.log

echo [ASSEMBLE] scagrp.bin
zma scagrp_link.asm scagrp.bin
move zma.log scagrp.log

rem ---------------------------------------------------------------------------
rem 	BSAVE形式のファイルを DISKIMAGE フォルダへ移動する
rem ---------------------------------------------------------------------------
move sca.bin ..\diskimage
move scagrp.bin ..\diskimage
echo release > ..\diskimage\mode.txt

rem ---------------------------------------------------------------------------
rem 	パスを元に戻す
rem ---------------------------------------------------------------------------
set PATH=%path_back%
pause
